# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, ConvNeXt_Stem, [96, 4, 4]],  # 0-P1/2
   [-1, 3, ConvNeXt_Block, [96]],  # 1
   [-1, 1, ConvNeXt_Downsample, [192, 2, 2]],   # 2-P2/4
   [-1, 3, ConvNeXt_Block, [192]],  # 3
   [-1, 1, ConvNeXt_Downsample, [384, 2, 2]],   # 4-P3/8
   [-1, 27, ConvNeXt_Block, [384]],  # 5
   [-1, 1, ConvNeXt_Downsample, [768, 2, 2]],   # 6-P4/16
   [-1, 3, ConvNeXt_Block, [768]],  # 7
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [384, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [384, False]],  # 11

   [-1, 1, Conv, [192, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]],  # cat backbone P2
   [-1, 3, C3, [192, False]],  # 15 (P3/8-small)

   [-1, 1, Conv, [192, 3, 2]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [384, False]],  # 18 (P4/16-medium)

   [-1, 1, Conv, [384, 3, 2]],
   [[-1, 8], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [768, False]],  # 21 (P5/32-large)

   [[15, 18, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
