nc: 1
depth_multiple: 0.33
width_multiple: 0.25

anchors: [[10, 13, 16, 30, 33, 23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]], 

backbone: [
    [-1, 1, SlimConv, [64, 1.0, 6, 2, 2]], 
    [-1, 1, SlimConv, [128, 1.0, 3, 2]], 
    [-1, 3, SlimC3, [128, 1.0, [1.0, 1.0, 1.0]]], 
    [-1, 1, SlimConv, [256, 1.0, 3, 2]], 
    [-1, 6, SlimC3, [256, 1.0, [1.0, 1.0, 1.0, 1.0, 1.0, 1.0]]], 
    [-1, 1, SlimConv, [512, 1.0, 3, 2]], 
    [-1, 9, SlimC3, [512, 1.0, [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]]], 
    [-1, 1, SlimConv, [1024, 0.96875, 3, 2]], 
    [-1, 3, SlimC3, [1024, 1.0, [1.0, 1.0, 1.0]]], 
    [-1, 1, SlimSPPF, [1024, 0.25,5]]
  ]
        
head: [
    [-1, 1, SlimConv, [512, 0.9375, 1, 1]], 
    [-1, 1, nn.Upsample, [None, 2, nearest]], 
    [[-1, 6], 1, Concat, [1]], 

    [-1, 3, SlimC3, [512, 0.9375, [1.0, 1.0, 1.0], false]], 
    [-1, 1, SlimConv, [256, 1.0, 1, 1]], 
    [-1, 1, nn.Upsample, [None, 2, nearest]], 
    [[-1, 4], 1, Concat, [1]], 

    [-1, 3, SlimC3, [256, 1.0, [1.0, 1.0, 1.0], false]], 
    [-1, 1, SlimConv, [256, 1.0, 3, 2]], 
    [[-1, 14], 1, Concat, [1]], 

    [-1, 3, SlimC3, [512, 1.0, [1.0, 1.0, 1.0], false]], 
    [-1, 1, SlimConv, [512, 0.875, 3, 2]], 
    [[-1, 10], 1, Concat, [1]], 
    
    [-1, 3, SlimC3, [1024, 0.875, [0.4375, 1.0, 1.0], false]], 
    [[17, 20, 23], 1, Detect, [nc, anchors]]
  ]
