nc: 80
depth_multiple: 1.0
width_multiple: 1.0
anchors: [[10, 13, 16, 30, 33, 23], [30, 61, 62, 45, 59, 119], [116, 90, 156, 198, 373, 326]]

backbone: [
    [-1, 1, SlimConv, [64, 1.0, 6, 2, 2]], 
    [-1, 1, SlimConv, [128, 0.6875, 3, 2]],
    [-1, 3, SlimC3, [128, 0.625, [1.0, 1.0, 1.0]]], 
    [-1, 1, SlimConv, [256, 0.71875, 3, 2]], 
    [-1, 6, SlimC3, [256, 0.84375, [0.9375, 0.6875, 0.4375, 0.6875, 0.75, 0.8125]]],
    [-1, 1, SlimConv, [512, 1.0, 3, 2]], 
    [-1, 9, SlimC3, [512, 0.84375, [0.78125, 0.46875, 0.9375, 0.65625, 0.65625, 0.8125, 0.4375, 0.78125, 0.40625]]],
    [-1, 1, SlimConv, [1024, 0.8671875, 3, 2]], 
    [-1, 3, SlimC3, [1024, 0.78125, [0.359375, 0.65625, 0.796875]]], 
    [-1, 1, SlimSPPF, [1024, 0.203125, 5]]
    ]

head: [
    [-1, 1, SlimConv, [512, 0.96875, 1, 1]], 
    [-1, 1, nn.Upsample, [None, 2, nearest]],
    [[-1, 6], 1, Concat, [1]], 
    [-1, 3, SlimC3, [512, 0.84375, [0.4375, 0.34375, 0.75], false]], 
    [-1, 1, SlimConv, [256, 0.9375, 1, 1]], 
    [-1, 1, nn.Upsample, [None, 2, nearest]], 
    [[-1, 4], 1, Concat, [1]], 
    [-1, 3, SlimC3, [256, 0.34375, [0.8125, 0.5625, 0.8125], false]], 
    [-1, 1, SlimConv, [256, 0.46875, 3, 2]],
    [[-1, 14], 1, Concat, [1]], 
    [-1, 3, SlimC3, [512, 0.828125, [0.46875, 0.71875, 0.78125], false]], 
    [-1, 1, SlimConv, [512, 0.5, 3, 2]], 
    [[-1, 10], 1, Concat, [1]], 
    [-1, 3, SlimC3, [1024, 0.9609375, [0.546875, 0.375, 0.734375], false]],

    [[17, 20, 23], 1, Detect, [nc, anchors]]
    ]
