# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, SlimConv, [64, 1.0, 6, 2, 2]],  # 0-P1/2
   [-1, 1, SlimConv, [128, 1.0, 3, 2]],  # 1-P2/4
   [-1, 3, SlimC3, [128, 1.0, [1.0, 1.0, 1.0]]],
   [-1, 1, SlimConv, [256, 1.0, 3, 2]],  # 3-P3/8
   [-1, 6, SlimC3, [256, 1.0, [1.0, 1.0, 1.0, 1.0, 1.0, 1.0]]],
   [-1, 1, SlimConv, [512, 1.0, 3, 2]],  # 5-P4/16
   [-1, 9, SlimC3, [512, 1.0, [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]]],
   [-1, 1, SlimConv, [1024, 1.0, 3, 2]],  # 7-P5/32
   [-1, 3, SlimC3, [1024, 1.0, [1.0, 1.0, 1.0]]],
   [-1, 1, SlimSPPF, [1024, 1.0, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, SlimConv, [512, 1.0, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, SlimC3, [512, 1.0, [1.0, 1.0, 1.0], False]],  # 13

   [-1, 1, SlimConv, [256, 1.0, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, SlimC3, [256, 1.0, [1.0, 1.0, 1.0], False]],  # 17 (P3/8-small)

   [-1, 1, SlimConv, [256, 1.0, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, SlimC3, [512, 1.0, [1.0, 1.0, 1.0], False]],  # 20 (P4/16-medium)

   [-1, 1, SlimConv, [512, 1.0, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, SlimC3, [1024, 1.0, [1.0, 1.0, 1.0], False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
